# -*- coding: utf-8 -*-
# http://opendata.cwb.gov.tw/opendatadoc/MFC/A0012-001.pdf
# 頻率副詞的關係以 list 順序表示，前面為主要，後面為次要

PREDICT_CODE_MAP = {
    1: '晴',
    2: '雲',
    3: '陰',
    4: '陰,雨',
    5: '多雲;陰',
    6: '陰;多雲',
    7: '多雲;晴',
    8: '晴;多雲',
    12: '多雲;陰;雨',
    13: '多雲;午後短暫陣雨',
    17: '多雲;陰;陣雨或雷雨',
    18: '多雲;午後短暫雷陣雨',
    24: '晴;午後短暫陣雨',
    26: '陰;多雲;雨',
    31: '陰;陣雨或雷雨',
    34: '晴;午後短暫雷陣雨',
    36: '陰;多雲;陣雨或雷雨',
    43: '晴;霧',
    44: '雲/陰;霧',
    45: '多雲;晴;霧',
    46: '晴;多雲;霧',
    49: '多雲;局部雨;霧',
    57: '陰;多雲;局部雨;霧',
    58: '多雲;陰;局部陣雨或雷雨;霧',
    59: '陰;多雲;局部陣雨或雷雨;霧',
    60: '雲/陰;雨;雪',
}
